app/views/patients/index.html.erb

      <tr>
        <td><%= Doctor.find(patient.doctor_id).name %></td>
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", nil]]