app/views/patients/show.html.erb

        <p>
          <strong>Doctor Name:</strong><%= Doctor.find(@patient.doctor_id).name %>
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]