app/views/doctors/show.html.erb

      <tbody>
        <% @doctor.patients.each do |patient| %>
---
SELECT "patients".* FROM "patients" WHERE "patients"."doctor_id" = ?  [["doctor_id", 1]]