app/controllers/access_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."name" = ?  ORDER BY "doctors"."id" ASC LIMIT 1  [["name", "ptest"]]
---
  def attempt_login
    if params[:name].present? && params[:password].present?

      found_user = Doctor.where(:name => params[:name]).first