app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "james"], ["password_digest", "$2a$10$/zYu9fIVk73RM3ZKa7CRce4YReDa/tQNx6EXlMLcb/osy/iPzDh2y"], ["created_at", "2015-11-08 10:54:37.908267"], ["updated_at", "2015-11-08 10:54:37.908267"]]
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["name", "Jake"], ["password_digest", "$2a$10$WYc0B7Yg3IA4LuTqswF3W.OUJ9BfMxrp776WyepzrsDhW5vGqIsei"], ["updated_at", "2015-11-27 00:52:37.717105"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 7]]
---
  def destroy
    @doctor.destroy