app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "email", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Alex"], ["email", "Mitchell"], ["content", "Quiet"], ["created_at", "2015-11-06 19:28:18.184111"], ["updated_at", "2015-11-06 19:28:18.184111"]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
        #PatientMailer.welcome_email(@patient).deliver_now
        format.html { redirect_to Doctor.find(@patient.doctor_id), notice: 'Patient was successfully created.' }

UPDATE "patients" SET "doctor_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["doctor_id", nil], ["updated_at", "2015-12-03 13:39:00.936660"], ["id", 1]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    respond_to do |format|
      if @patient.update(patient_params)
        format.html { redirect_to Doctor.find(@patient.doctor_id), notice: 'Patient was successfully updated.' }

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 2]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    temp_id = @patient.doctor_id
    @patient.destroy
    respond_to do |format|
      format.html { redirect_to Doctor.find(@patient.doctor_id), notice: 'Patient was successfully destroyed.' }